In [ ]:
# CREATE TABLE Brew (
#     Sales_ID INT PRIMARY KEY,
#     Region VARCHAR(205) NOT NULL,
#     Months VARCHAR(20) NOT NULL,
#     Year INT NOT NULL,
#     Sales_Rep VARCHAR(50) NOT NULL,
#     Brands VARCHAR(20) NOT NULL,
#     Unit_Cost NUMERIC NOT NULL,
#     Unit_Price NUMERIC NOT NULL,
#     Quantity INT NOT NULL,
#     Country VARCHAR(20) NOT NULL
# );

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:


# Define database connection URL
DATABASE_URL = "postgresql://postgres:your_new_password@localhost/brew"

# Create engine
engine = create_engine(DATABASE_URL)

# Load SQL extension
%reload_ext sql

# Using the connection string
%sql $DATABASE_URL

In [18]:
# from sqlalchemy import create_engine

# DATABASE_URL = "postgresql://postgres:your_new_password@localhost/brew"
# engine = create_engine(DATABASE_URL)

# # Test connection
# try:
#     with engine.connect() as connection:
#         print("Connected successfully!")
# except Exception as e:
#     print("Connection failed:", e)

Connected successfully!

In [5]:
query = '''

SELECT *
FROM brew
WHERE REGION ='northwest'
LIMIT 5
'''

In [6]:
df = pd.read_sql(query, engine)

In [7]:
df

,sales_id,region,months,year,sales_rep,brands,unit_cost,unit_price,quantity,country
0,10116,northwest,April,2020,Jones,budweiser,250.0,500.0,709,Ghana
1,10140,northwest,April,2020,Jardine,hero,150.0,200.0,999,Senegal
2,10152,northwest,April,2020,Parent,castle lite,180.0,450.0,878,Nigeria
3,10182,northwest,October,2020,Andrews,hero,150.0,200.0,773,Nigeria
4,10224,northwest,April,2020,Parent,hero,150.0,200.0,914,Benin

In [10]:
query = 'SELECT * FROM brew lIMIT 5'

In [11]:
df = pd.read_sql(query, engine)

In [12]:
df

,sales_id,region,months,year,sales_rep,brands,unit_cost,unit_price,quantity,country
0,10101,Southeast,January,2020,Jardine,trophy,150.0,200.0,725,Ghana
1,10106,northcentral,June,2020,Jardine,beta malt,80.0,150.0,798,Ghana
2,10109,southsouth,September,2020,Morgan,budweiser,250.0,500.0,700,Benin
3,10112,northcentral,December,2020,Jones,hero,150.0,200.0,902,Nigeria
4,10116,northwest,April,2020,Jones,budweiser,250.0,500.0,709,Ghana

In [13]:
import psycopg2

In [14]:
conn = psycopg2.connect(
    host= "localhost",
    database = "brew",
    user = "postgres",
    password ="your_new_password"

)

In [17]:
query = """
SELECT * FROM brew
WHERE Months = 'January'

"""

In [18]:
show = pd.read_sql(query,conn)

C:\Users\DELL\AppData\Local\Temp\ipykernel_30708\3766420020.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  show = pd.read_sql(query,conn)

In [19]:
print(show)

    sales_id     region   months  year sales_rep       brands  unit_cost  \
0      10101  Southeast  January  2020   Jardine       trophy      150.0
1      10161  Southeast  January  2020    Parent         hero      150.0
2      10173  Southeast  January  2020    Morgan  castle lite      180.0
3      10197  Southeast  January  2020     Jones    beta malt       80.0
4      10245  Southeast  January  2020   Andrews         hero      150.0
..       ...        ...      ...   ...       ...          ...        ...
83     11025  Southeast  January  2018      Gill       trophy      150.0
84     11049  Southeast  January  2018   Andrews  eagle lager      170.0
85     11073  Southeast  January  2018    Howard   grand malt       90.0
86     11085  Southeast  January  2018     Smith         hero      150.0
87     11121  Southeast  January  2018    Parent    beta malt       80.0

    unit_price  quantity  country
0        200.0       725    Ghana
1        200.0       847    Ghana
2        450.0       727     Togo
3        150.0       896  Nigeria
4        200.0       924  Senegal
..         ...       ...      ...
83       200.0       906  Senegal
84       250.0       792    Benin
85       150.0       927     Togo
86       200.0       993  Senegal
87       150.0       842    Ghana

[88 rows x 10 columns]